000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CONVDATE.
000300 AUTHOR.     HINKOKO.
000400**************************************************
000500*  THIS PROGRAM IS INTENDED TO :                 *
000600*     - ACCEPT A DATE EITHER FR | US             *
000700*     - RETURNED THE DESIRED FORMAT  US | FR     *
000800***************************************************
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SPECIAL-NAMES.
001200     DECIMAL-POINT IS COMMA.
001300 DATA DIVISION.
001400 WORKING-STORAGE SECTION.
001500
001600 01 WS-DATE-US.
001700    05 US-AA    PIC X(4).
001800    05 FILLER   PIC X(1)     VALUE  '/'.
001900    05 US-MM    PIC X(2).
002000    05 FILLER   PIC X(1)     VALUE  '/'.
002100    05 US-JJ    PIC X(2).
002110
002200 01 WS-DATE-FR.
002300    05 FR-JJ    PIC X(2).
002310    05 FILLER   PIC X(1)     VALUE  '/'.
002320    05 FR-MM    PIC X(2).
002330    05 FILLER   PIC X(1)     VALUE  '/'.
002340    05 FR-AA    PIC X(4).
002350
002360 01 ED-JJ      PIC Z9.
002370 01 TMP-DATE   PIC X(30).
002380 77 WS-ANO     PIC 9 VALUE 0.
002400 77 WS-DATE    PIC X(10).
002500*********************
002510 LINKAGE SECTION.
002520 01 LS-DATE      PIC X(10).
002530 01 LS-FORMAT    PIC X(02).
002540********************
002550 PROCEDURE DIVISION USING LS-DATE, LS-FORMAT.
002560       EVALUATE TRUE
002570         WHEN LS-FORMAT = 'US'
002580            PERFORM USA-DATE
002590         WHEN LS-FORMAT = 'FR'
002591            PERFORM EUROPA-DATE
002592         WHEN OTHER
002593            DISPLAY 'INVALID DATE FORMAT - U MARTIAN ? '
002594       END-EVALUATE
002595
002596       GOBACK.
002597**** PARAGRAPHS *****
002598 USA-DATE.
002599     UNSTRING LS-DATE DELIMITED BY '/'
002600        INTO US-JJ US-MM US-AA
002610     END-UNSTRING
002611
002612     INITIALIZE LS-DATE
002613         STRING US-AA    DELIMITED BY SIZE
002614             '-'         DELIMITED BY SIZE
002615             US-MM       DELIMITED BY SIZE
002616             '-'         DELIMITED BY SIZE
002617             US-JJ       DELIMITED BY SIZE
002618         INTO LS-DATE
002619     .
002620 EUROPA-DATE.
002621     UNSTRING LS-DATE DELIMITED BY '/'
002622        INTO FR-JJ FR-MM FR-AA
002623     END-UNSTRING
002624
002625     INITIALIZE LS-DATE
002626         STRING FR-JJ  DELIMITED BY SIZE
002627             '-'       DELIMITED BY SIZE
002628             FR-MM     DELIMITED BY SIZE
002629             '-'       DELIMITED BY SIZE
002630             FR-AA     DELIMITED BY SIZE
002631         INTO LS-DATE
002632     .
002633
002634
002635
002636
002637
002640
002650
002660
002700
