000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. STPROG.
000300 AUTHOR.     HINKOKO.
000400*******************************************************
000500*   THIS PROGRAM IS INTENDED TO MAP A STATE CODE      *
000600*   TO ITS FULL TEXT REPRESENTATION                   *
000700*   RETURN THE FULL STATE NAME TO CALLER              *
000800*******************************************************
000900
001000 ENVIRONMENT DIVISION.
001100 INPUT-OUTPUT SECTION.
001200 FILE-CONTROL.
001300        SELECT STATEK ASSIGN TO STATEK
001400        ORGANIZATION IS INDEXED
001500        ACCESS MODE IS RANDOM
001600        RECORD KEY IS STATE-CODE
001700        FILE STATUS IS FS-STATE.
001800
001900 DATA DIVISION.
002000 FILE SECTION.
002100 FD STATEK.
002200 01 ST-STATEK.
002300      05 STATE-CODE    PIC X(2).
002400      05 STATE-NAME    PIC X(30).
002500      05 FILLER        PIC X(48).
002510
002600 WORKING-STORAGE SECTION.
002700 77 FS-STATE         PIC 99.
002800 77 WS-ANO           PIC 9.
002900 77 WS-VAR           PIC 9 VALUE 0.
003000
003100 LINKAGE SECTION.
003200 01 LK-ST-CODE       PIC X(2).
003300 01 LK-ST-NAME       PIC X(30).
003400
003500 PROCEDURE DIVISION USING LK-ST-CODE LK-ST-NAME.
003600       DISPLAY 'RECEIVED CODE ' LK-ST-CODE
003700       OPEN INPUT STATEK
003800       PERFORM CHECK-FILE-STATUS
003900
004000       MOVE LK-ST-CODE TO STATE-CODE
004100       READ STATEK
004200       EVALUATE FS-STATE
004300           WHEN ZERO
004400              MOVE STATE-NAME TO LK-ST-NAME
004500           WHEN 23
004600              DISPLAY 'ETAT ' LK-ST-CODE ' INTROUVABLE.'
004700           WHEN OTHER
004800              DISPLAY 'ERROR: FILE STATUS -> ' FS-STATE
004900              PERFORM ABEND-PROG
005000       END-EVALUATE
005100
005200       CLOSE STATEK
005210       PERFORM CHECK-FILE-STATUS
005220       GOBACK.
005230
005240 CHECK-FILE-STATUS.
005250       IF FS-STATE NOT = 0 THEN
005260             DISPLAY 'ERROR: FILE STATUS: ' FS-STATE
005270             PERFORM ABEND-PROG
005280       END-IF
005290       .
005291 ABEND-PROG.
005292       COMPUTE WS-ANO = WS-ANO / WS-VAR
005293       .
