       01 ENR-VENTES-AS.
          05 AS-O-NO PIC 9(03).
          05 AS-O-DATE PIC X(10).
          05 AS-E-NO PIC 9(02).
          05 AS-C-NO PIC 9(04).
          05 AS-P-NO PIC X(03).
          05 AS-PRICE PIC 9(03)V9(2).
          05 AS-QUANTITY PIC 9(02).
          05 FILLER PIC X(51).
       