000100 01 ENR-VENTES-AS.
000200    05 AS-O-NO PIC 9(03).
000300    05 AS-O-DATE PIC X(10).
000400    05 AS-E-NO PIC 9(02).
000500    05 AS-C-NO PIC 9(04).
000600    05 AS-P-NO PIC X(03).
000700    05 AS-PRICE PIC 9(03)V9(2).
000800    05 AS-QUANTITY PIC 9(02).
000900    05 FILLER PIC X(51).
