000100 01 ENR-VENTES-EU.
000200    05 EU-O-NO PIC 9(03).
000300    05 EU-O-DATE PIC X(10).
000400    05 EU-E-NO PIC 9(02).
000500    05 EU-C-NO PIC 9(04).
000600    05 EU-P-NO PIC X(03).
000700    05 EU-PRICE PIC 9(03)V9(2).
000800    05 EU-QUANTITY PIC 9(02).
000900    05 FILLER PIC X(51).
