       01 ENR-VENTES-EU.
          05 EU-O-NO PIC 9(03).
          05 EU-O-DATE PIC X(10).
          05 EU-E-NO PIC 9(02).
          05 EU-C-NO PIC 9(04).
          05 EU-P-NO PIC X(03).
          05 EU-PRICE PIC 9(03)V9(2).
          05 EU-QUANTITY PIC 9(02).
          05 FILLER PIC X(51).
       