000100 01 ENR-VENTE-ST.
000200    05 ENR-O-NO PIC 9(03).
000300    05 ENR-O-DATE PIC X(10).
000400    05 ENR-E-NO PIC 9(02).
000500    05 ENR-C-NO PIC 9(04).
000600    05 ENR-P-NO PIC X(03).
000700    05 ENR-PRICE PIC 9(03)V9(2).
000800    05 ENR-QUANTITY PIC 9(02).
000900    05 FILLER PIC X(51).
