       01 ENR-VENTE-ST.
          05 ENR-O-NO PIC 9(03).
          05 ENR-O-DATE PIC X(10).
          05 ENR-E-NO PIC 9(02).
          05 ENR-C-NO PIC 9(04).
          05 ENR-P-NO PIC X(03).
          05 ENR-PRICE PIC 9(03)V9(2).
          05 ENR-QUANTITY PIC 9(02).
          05 FILLER PIC X(51).
       