000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. EDORD.
000300
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SPECIAL-NAMES.
000700     DECIMAL-POINT IS COMMA.
000800
000900 INPUT-OUTPUT SECTION.
001000 FILE-CONTROL.
001100     SELECT FEXT ASSIGN TO FICEXT.
001200     SELECT FACT ASSIGN TO FICFACT.
001310
001320 DATA DIVISION.
001400 FILE SECTION.
001410* DECLARATION ENREGISTREMENTS FICHIER
001610 FD FEXT.
001620 01 ENR-FEXT.
001630    05 FILLER        PIC X.
001910    05 F-P-NO        PIC X(3).
001920    05 F-QUANTITY    PIC X(2).
001930    05 F-PRICE       PIC X(6).
001940    05 F-DESCRIPTION PIC X(30).
001950    05 F-O-NO        PIC X(3).
001960    05 F-O-DATE      PIC X(10).
001970    05 F-COMPANY     PIC X(30).
001980    05 F-ADDRESS     PIC X(100).
001990    05 F-CITY        PIC X(20).
001991    05 F-ZIP         PIC X(5).
001992    05 F-STATE       PIC X(2).
001993    05 F-LNAME       PIC X(20).
001994    05 F-FNAME       PIC X(20).
001995    05 F-DNAME       PIC X(20).
001996    05 FILLER        PIC X(28).
001997
001998 FD FACT.
001999 01 ENR-FACT.
002000    05 FILLER        PIC X.
002001    05 FILLER        PIC X(79).
002002
002010 WORKING-STORAGE SECTION.
002039
002040* VARIABLES FONCTION ABEND-PROG
002041 77 WS-ANO PIC 9 VALUE ZERO.
002042 77 WS-VAR PIC 9 VALUE ZERO.
002043* VARIABLES FLAG FICHIER
002044 77 WS-FLAG PIC 9 VALUE ZERO.
002045    88 FF-FEXT VALUE 1.
002046
002314* VARIABLES CALCUL
002315* WS-TOTAL = WS-QTY * WS-PRICE
002326 77 WS-TOTAL       PIC 9(4)V9(2).
002327 77 WS-QTY         PIC 9(2).
002328 77 WS-PRICE       PIC 9(3)V9(2).
002329 77 TP-PRICE       PIC 9(3)V9(2).
002332 77 WS-TOTAL-HT    PIC 9(4)V9(2).
002334 77 WS-TOTAL-TTC   PIC 9(4)V9(2).
002336 77 WS-TOTAL-COM   PIC 9(4)V9(2).
002338 77 WS-TOTAL-TAX   PIC 9(4)V9(2).
002339 77 AC-TAX         PIC 9(2)V9(2).
002340 77 WS-TP-TAX      PIC 9(2)V9(2).
002341* VARIABLES EDITION
002342 77 ED-MONTANT     PIC ZZ9,9(2).
002343 77 ED-TOTAL       PIC ZZZ9,9(2).
002344 77 ED-QTY         PIC 99.
002345 77 ED-CONTACT     PIC X(70).
002346* VARIABLES CURRENT
002347 77 WS-CUR-O-NO   PIC X(3).
002444
002445 01 L-TIRET.
002460    05 FILLER  PIC X(80) VALUE ALL '-'.
002461
002462 01 L-TIRET-CUS.
002463    05 FILLER  PIC X(3)  VALUE     '|  '.
002464    05 FILLER  PIC X(40) VALUE ALL ' '.
002465    05 FILLER  PIC X(34) VALUE ALL '-'.
002466    05 FILLER  PIC X(3)  VALUE     '  |'.
002467
002468 01 L-TIRET-ITE.
002470    05 FILLER  PIC X(3)  VALUE     '|  '.
002472    05 FILLER  PIC X(74) VALUE ALL '-'.
002474    05 FILLER  PIC X(3)  VALUE     '  |'.
002475
002476 01 L-VIDE.
002477    05 FILLER  PIC X(3)  VALUE     '|  '.
002478    05 FILLER  PIC X(74) VALUE ALL ' '.
002479    05 FILLER  PIC X(3)  VALUE     '  |'.
002480
002481 01 L-TOTAL.
002482    05 FILLER      PIC X(3)  VALUE     '|  '.
002483    05 FILLER      PIC X(40) VALUE ALL ' '.
002484    05 L-FOO-TITLE PIC X(27).
002485    05 L-FOO-DATA  PIC ZZZZ,99.
002486    05 FILLER      PIC X(3)  VALUE     '  |'.
002487
002488 01 L-TITLE-ITE.
002489    05 FILLER  PIC X(4)  VALUE     '|  |'.
002490    05 FILLER  PIC X(8) VALUE 'P_NO   |'.
002491    05 FILLER  PIC X(18) VALUE ALL ' '.
002492    05 FILLER  PIC X(12) VALUE 'DESCRIPTION|'.
002493    05 FILLER  PIC X(10) VALUE 'QUANTITY |'.
002494    05 FILLER  PIC X(8) VALUE 'PRICE  |'.
002495    05 FILLER  PIC X(16) VALUE 'TOTAL LIGNE     '.
002496    05 FILLER  PIC X(4)  VALUE     '|  |'.
002497
002498 01 L-ITE.
002499    05 FILLER    PIC X(4)  VALUE     '|  |'.
002500    05 L-ITE-NO  PIC X(7).
002501    05 FILLER    PIC X  VALUE     '|'.
002502    05 L-ITE-DES PIC X(29).
002503    05 FILLER    PIC X  VALUE     '|'.
002504    05 L-ITE-QTY PIC X(9).
002505    05 FILLER    PIC X  VALUE     '|'.
002506*   05 L-ITE-PRI PIC X(8).
002507*   05 L-ITE-TOT PIC X(16).
002508    05 FILLER  PIC X(2) VALUE ALL ' '.
002509    05 L-ITE-PRI PIC ZZZ,99.
002510    05 FILLER    PIC X  VALUE     '|'.
002511    05 FILLER  PIC X(8) VALUE ALL ' '.
002512    05 L-ITE-TOT PIC ZZZZ,99.
002513    05 FILLER    PIC X(4)  VALUE     '|  |'.
002514
002515 01 L-DATE.
002516    05 FILLER  PIC X(3)  VALUE     '|  '.
002517    05 FILLER  PIC X(3)  VALUE     '   '.
002518    05 L-DATE-TITLE PIC X(10).
002519    05 L-DATE-DATA PIC X(30).
002520    05 FILLER  PIC X(31) VALUE ALL ' '.
002521    05 FILLER  PIC X(3)  VALUE     '  |'.
002522
002523 01 L-ORD.
002524    05 FILLER  PIC X(3)  VALUE     '|  '.
002525    05 L-ORD-DATA PIC X(10).
002526    05 FILLER  PIC X(64) VALUE ALL ' '.
002527    05 FILLER  PIC X(3)  VALUE     '  |'.
002528
002529 01 L-EMP-DEUX-LIGNES.
002530    05 FILLER  PIC X(3)  VALUE     '|  '.
002531    05 L-EMP-DATA-LNAME PIC X(20).
002532    05 FILLER  PIC X VALUE ALL ','.
002533    05 L-EMP-DATA-FNAME PIC X(20).
002534    05 FILLER  PIC X(33) VALUE ALL ' '.
002535    05 FILLER  PIC X(3)  VALUE     '  |'.
002536
002537 01 L-EMP-UNE-LIGNE.
002538    05 FILLER  PIC X(3)  VALUE     '|  '.
002541    05 L-EMP-DATA PIC X(74).
002543    05 FILLER  PIC X(3)  VALUE     '  |'.
002544
002545 01 L-DEP.
002546    05 FILLER  PIC X(3)  VALUE     '|  '.
002547    05 L-DEP-TITLE PIC X(30).
002548    05 L-DEP-DATA PIC X(20).
002549    05 FILLER  PIC X(3) VALUE ALL ' : '.
002550    05 FILLER  PIC X(21) VALUE ALL ' '.
002551    05 FILLER  PIC X(3)  VALUE     '  |'.
002552
002553 01 L-CUS.
002554    05 FILLER       PIC X(3)  VALUE     '|  '.
002555    05 FILLER       PIC X(40) VALUE ALL ' '.
002556* TIRET = 34
002557    05 FILLER       PIC X(2) VALUE '| '.
002558    05 L-CUS-TITLE  PIC X(8).
002559    05 FILLER       PIC X(2) VALUE '  '.
002560    05 L-CUS-DATA   PIC X(20).
002561    05 FILLER       PIC X(2) VALUE ' |'.
002562* TIRET = 34
002563    05 FILLER       PIC X(3)  VALUE     '  |'.
002564* TIRET = 34
002565* LONGUEUR = 79 + FILLER 1 --> FICHIER 80
002566
002570 PROCEDURE DIVISION.
002600      PERFORM OPEN-FEXT
002710      PERFORM READ-FEXT
002720      PERFORM OPEN-FACT
002730
002731      PERFORM INIT-ORDER
002740      PERFORM WRITE-FACT-TOP
002750      PERFORM WRITE-FACT-ITE-TOP
002900
003000      PERFORM UNTIL FF-FEXT
003013
003014         PERFORM WRITE-FACT-ITE UNTIL FF-FEXT OR
003015                       F-O-NO NOT EQUAL WS-CUR-O-NO
003017
003034         PERFORM WRITE-FACT-ITE-BOTTOM
003035         PERFORM WRITE-FACT-BOTTOM
003040         PERFORM INIT-ORDER
003041         IF NOT FF-FEXT
003042            PERFORM WRITE-FACT-TOP
003043            PERFORM WRITE-FACT-ITE-TOP
003050         END-IF
003700      END-PERFORM
004000      PERFORM CLOSE-FEXT
004010      PERFORM CLOSE-FACT
004100      GOBACK.
004110******************************************
004120* PARAGRAPHES
004200******************************************
004760 CLOSE-FEXT.
004770     CLOSE FEXT.
004780 OPEN-FEXT.
004790     OPEN INPUT FEXT.
004791 CLOSE-FACT.
004792     CLOSE FACT.
004793 OPEN-FACT.
004794     OPEN OUTPUT FACT.
004800 READ-FEXT.
004810     READ FEXT AT END
004820         SET FF-FEXT TO TRUE
004821         DISPLAY 'FICHIER EXTRACT VIDE OU FINI'
004822     END-READ.
004829 ABEND-PROG.
004830     COMPUTE WS-ANO = WS-ANO / WS-VAR.
004831******************************************
004840* PARAGRAPHES DIVERS WRITE
004850******************************************
004860 WRITE-FACT-ITE-TOP.
004861     DISPLAY L-TIRET-ITE
004870     DISPLAY L-TITLE-ITE
004871     DISPLAY L-TIRET-ITE
004872     WRITE ENR-FACT FROM L-TIRET-ITE
004873     WRITE ENR-FACT FROM L-TITLE-ITE
004874     WRITE ENR-FACT FROM L-TIRET-ITE
004880     .
004890 WRITE-FACT-ITE-BOTTOM.
004900     DISPLAY L-TIRET-ITE
004910     WRITE ENR-FACT FROM L-TIRET-ITE
005000     .
009000 WRITE-FACT-ITE.
009001* CALCULS ET CAST
009003     COMPUTE TP-PRICE = FUNCTION NUMVAL(F-PRICE)
009006     MOVE    TP-PRICE   TO WS-PRICE
009014     COMPUTE WS-TOTAL = WS-QTY * WS-PRICE
009015     MOVE F-QUANTITY     TO WS-QTY
009016     MOVE WS-TOTAL       TO ED-TOTAL
009018     MOVE WS-PRICE       TO ED-MONTANT
009020     MOVE WS-QTY         TO ED-QTY
009021* TRAITEMENT TOTAUX
009022     ADD WS-TOTAL TO WS-TOTAL-HT
009023* MOVE DANS LIGNE
009024     MOVE F-P-NO         TO L-ITE-NO
009025     MOVE F-DESCRIPTION  TO L-ITE-DES
009026     MOVE ED-QTY         TO L-ITE-QTY
009027     MOVE ED-MONTANT     TO L-ITE-PRI
009028     MOVE ED-TOTAL       TO L-ITE-TOT
009029     DISPLAY L-ITE
009030     WRITE ENR-FACT FROM L-ITE
009031     PERFORM CLEAN-L-ITE
009032*    PERFORM CLEAN-F
009033     PERFORM INIT-ITEM
009040     PERFORM READ-FEXT
009410     .
009500 WRITE-FACT-CUS.
009509     DISPLAY L-TIRET-CUS
009510     WRITE ENR-FACT FROM L-TIRET-CUS
009511     MOVE 'COMPANY'   TO L-CUS-TITLE
009512     MOVE F-COMPANY   TO L-CUS-DATA
009513     DISPLAY L-CUS
009514     WRITE ENR-FACT FROM L-CUS
009515*    PERFORM CLEAN-L-CUS
009516*    MOVE SPACES TO F-COMPANY
009517     MOVE 'ADDRESS'   TO L-CUS-TITLE
009518     MOVE F-ADDRESS   TO L-CUS-DATA
009519     DISPLAY L-CUS
009520     WRITE ENR-FACT FROM L-CUS
009521*    PERFORM CLEAN-L-CUS
009522*    MOVE SPACES TO F-ADDRESS
009523     MOVE 'CITY,ZIP'  TO L-CUS-TITLE
009524     MOVE F-CITY      TO L-CUS-DATA
009525     DISPLAY L-CUS
009526     WRITE ENR-FACT FROM L-CUS
009527*    PERFORM CLEAN-L-CUS
009528*    MOVE SPACES TO F-CITY
009529*    MOVE SPACES TO F-ZIP
009530     MOVE 'STATE'     TO L-CUS-TITLE
009531     MOVE F-STATE     TO L-CUS-DATA
009532     DISPLAY L-CUS
009533     WRITE ENR-FACT FROM L-CUS
009534     DISPLAY L-TIRET-CUS
009535     WRITE ENR-FACT FROM L-TIRET-CUS
009536*    PERFORM CLEAN-L-CUS
009537     MOVE SPACES TO F-STATE
009538     .
009540 CLEAN-L-CUS.
009550*    MOVE SPACES TO L-CUS-DATA
009551*    MOVE SPACES TO L-CUS-TITLE
009552     MOVE '-----------------------' TO L-CUS-DATA
009553     MOVE SPACES TO L-CUS-TITLE
009560     .
009561 CLEAN-L-EMP.
009562     MOVE SPACES TO L-DEP-DATA
009563     MOVE SPACES TO L-EMP-DATA-FNAME
009564     MOVE SPACES TO L-EMP-DATA-LNAME
009565     MOVE SPACES TO L-EMP-DATA
009566     .
009570 CLEAN-L-ITE.
009580     MOVE SPACES TO L-ITE-NO
009581     MOVE SPACES TO L-ITE-DES
009582     MOVE SPACES TO L-ITE-QTY
009583     MOVE 0 TO L-ITE-PRI
009584     MOVE 0 TO L-ITE-TOT
009590     .
009598 CLEAN-L-DAT.
009599     MOVE SPACES TO L-DATE-DATA
009600     .
009601 CLEAN-L-ORD.
009602     MOVE SPACES TO L-ORD-DATA
009603     .
009604 WRITE-FACT-DAT.
009605     MOVE 'PARIS, LE ' TO L-DATE-TITLE
009606     MOVE 'MARDI 12 NOVEMBRE 2024             ' TO L-DATE-DATA
009607     DISPLAY L-DATE
009608     WRITE ENR-FACT FROM L-DATE
009609     PERFORM CLEAN-L-DAT
009610     .
009700 WRITE-FACT-ORD.
009702     MOVE F-O-NO TO L-ORD-DATA
009703     DISPLAY L-ORD
009704     WRITE ENR-FACT FROM L-ORD
009705     MOVE F-O-DATE TO L-ORD-DATA
009706     DISPLAY L-ORD
009707     WRITE ENR-FACT FROM L-ORD
009708     PERFORM CLEAN-L-ORD
009710     .
009800 WRITE-FACT-EMP.
009802*    MOVE F-DNAME TO L-DEP-DATA
009803*    MOVE 'VOTRE CONTACT AU DEPARTEMENT' TO L-DEP-TITLE
009804*    DISPLAY L-DEP
009805*    WRITE ENR-FACT FROM L-DEP
009806*    MOVE F-LNAME TO L-EMP-DATA-LNAME
009807*    MOVE F-FNAME TO L-EMP-DATA-FNAME
009808*    DISPLAY L-EMP-DEUX-LIGNES
009809*    WRITE ENR-FACT FROM L-EMP
009810     INSPECT F-DNAME REPLACING ALL SPACE BY LOW-VALUE
009811     INSPECT F-LNAME REPLACING ALL SPACE BY LOW-VALUE
009812     INSPECT F-FNAME REPLACING ALL SPACE BY LOW-VALUE
009813     STRING
009814          'VOTRE CONTACT AU DEPARTEMENT ' DELIMITED BY SIZE
009815          F-DNAME  DELIMITED BY ' '
009816          ' : '    DELIMITED BY SIZE
009817          F-LNAME  DELIMITED BY ' '
009818          ', '     DELIMITED BY SIZE
009819          F-FNAME  DELIMITED BY ' '
009820     INTO ED-CONTACT
009821     END-STRING
009822     MOVE ED-CONTACT TO L-EMP-DATA
009823     WRITE ENR-FACT FROM L-EMP-UNE-LIGNE
009824     PERFORM CLEAN-L-EMP
009825     .
009830 WRITE-FACT-BOTTOM.
009831     MOVE 0,20 TO AC-TAX
009832     MOVE 99,99 TO WS-TOTAL-COM
009833     COMPUTE WS-TP-TAX = AC-TAX + 1
009834     COMPUTE WS-TOTAL-TAX = WS-TOTAL-HT * AC-TAX
009835     COMPUTE WS-TOTAL-TTC = WS-TOTAL-HT * WS-TP-TAX
009837     MOVE 'TOTAL HT'           TO L-FOO-TITLE
009838     MOVE WS-TOTAL-HT          TO L-FOO-DATA
009839     DISPLAY L-TOTAL
009840     WRITE ENR-FACT FROM L-VIDE
009841     WRITE ENR-FACT FROM L-TOTAL
009842     WRITE ENR-FACT FROM L-VIDE
009843     MOVE 'TOTAL TAX'          TO L-FOO-TITLE
009844     MOVE WS-TOTAL-TAX         TO L-FOO-DATA
009845     DISPLAY L-TOTAL
009846     WRITE ENR-FACT FROM L-TOTAL
009847     WRITE ENR-FACT FROM L-VIDE
009848     MOVE 'TOTAL COM'          TO L-FOO-TITLE
009849     MOVE WS-TOTAL-COM         TO L-FOO-DATA
009850     DISPLAY L-TOTAL
009851     WRITE ENR-FACT FROM L-TOTAL
009852     WRITE ENR-FACT FROM L-VIDE
009853     MOVE 'TOTAL TTC'          TO L-FOO-TITLE
009854     MOVE WS-TOTAL-TTC         TO L-FOO-DATA
009855     DISPLAY L-TOTAL
009856     WRITE ENR-FACT FROM L-TOTAL
009857     WRITE ENR-FACT FROM L-VIDE
009858     WRITE ENR-FACT FROM L-TIRET
009859     .
009860 WRITE-FACT-TOP.
009870     WRITE   ENR-FACT FROM L-TIRET
009880     WRITE   ENR-FACT FROM L-VIDE
009903     PERFORM WRITE-FACT-CUS
009904     PERFORM WRITE-FACT-DAT
009905     WRITE   ENR-FACT FROM L-VIDE
009906     PERFORM WRITE-FACT-ORD
009907     PERFORM WRITE-FACT-EMP
009908     WRITE   ENR-FACT FROM L-VIDE
009909     WRITE   ENR-FACT FROM L-VIDE
009910     .
009911 INIT-ORDER.
009912     MOVE F-O-NO TO WS-CUR-O-NO
009913     MOVE ZERO TO WS-TOTAL-HT
009914     MOVE ZERO TO WS-TOTAL-TTC
009915     MOVE ZERO TO WS-TOTAL-COM
009916     MOVE ZERO TO WS-TOTAL-TAX
009917     MOVE ZERO TO AC-TAX
009920     MOVE ZERO TO WS-TP-TAX
010000     .
010010 INIT-ITEM.
010020     MOVE F-O-NO TO WS-CUR-O-NO
010050     .
010060 CLEAN-F.
010400     MOVE SPACES TO F-P-NO
010500     MOVE SPACES TO F-QUANTITY
010600     MOVE SPACES TO F-PRICE
010700     MOVE SPACES TO F-DESCRIPTION
010800     MOVE SPACES TO F-O-NO
010900     MOVE SPACES TO F-O-DATE
011000     MOVE SPACES TO F-COMPANY
011100     MOVE SPACES TO F-ADDRESS
011200     MOVE SPACES TO F-CITY
011300     MOVE SPACES TO F-ZIP
011400     MOVE SPACES TO F-STATE
011500     MOVE SPACES TO F-LNAME
011600     MOVE SPACES TO F-FNAME
011700     MOVE SPACES TO F-DNAME
011800     .
