000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. P5.
000300
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SPECIAL-NAMES.
000700     DECIMAL-POINT IS COMMA.
000800
000900*INPUT-OUTPUT SECTION.
001000*FILE-CONTROL.
001100*    SELECT FAFF ASSIGN TO FICAFF.
001310
001320 DATA DIVISION.
001400*FILE SECTION.
001410* DECLARATION ENREGISTREMENTS FICHIER
001610*FD FAFF.
001620*01 ENR-FAFF PIC X(200).
001900
002000 WORKING-STORAGE SECTION.
002001******************************************
002002* INSERT DES DECLARATIONS SQL
002003     EXEC SQL INCLUDE SQLCA  END-EXEC.
002004* APPEL DU DLCGEN ...
002005     EXEC SQL INCLUDE PARTS  END-EXEC.
002006     EXEC SQL INCLUDE PARTSUPP  END-EXEC.
002007     EXEC SQL INCLUDE SUP    END-EXEC.
002017******************************************
002018* DECLARATION DU CURSEUR ORDERS
002019
002031
002032*    EXEC SQL
002033*        DECLARE CURS1 CURSOR
002034*        FOR
002035*        SELECT S.SNO, S.SNAME, P.PNO, P.PNAME, PA.QTY
002036*        FROM API11.PARTSUPP PA
002037*             JOIN API11.PARTS P ON PA.PNO = P.PNO
002038*             JOIN API11.SUPPLIER S ON PA.SNO = S.SNO
002039*        GROUP BY S.SNO, S.SNAME, P.PNO, P.PNAME, PA.QTY
002040*    END-EXEC.
002041
002042     EXEC SQL
002043         DECLARE CURS1 CURSOR
002044         FOR
002045         SELECT S.SNO, S.SNAME , P.PNO,
002046            P.PNAME, PA.QTY
002047         FROM API11.PARTSUPP PA JOIN API11.PARTS P ON
002048                        PA.PNO = P.PNO
002049                      JOIN API11.SUPPLIER S ON PA.SNO = S.SNO
002050         GROUP BY S.SNO, S.SNAME, P.PNO, P.PNAME, PA.QTY
002051         ORDER BY S.SNO, P.PNO
002052     END-EXEC.
002060
002061
002062
002063     EXEC SQL
002064         DECLARE CURS2 CURSOR
002065         FOR
002066         SELECT P.PNAME, P.PNO
002067         FROM API11.PARTS P
002068     END-EXEC.
002069
002070     EXEC SQL
002071         DECLARE CURS3 CURSOR
002072         FOR
002073         SELECT S.SNAME, S.SNO
002074         FROM API11.SUPPLIER S
002075     END-EXEC.
002076
002077
002078* VARIABLES FONCTION ABEND-PROG
002079 77 WS-ANO PIC 9 VALUE ZERO.
002080 77 WS-VAR PIC 9 VALUE ZERO.
002081
002082 77 WS-I PIC 99 VALUE ZERO.
002083 77 WS-J PIC 99 VALUE ZERO.
002090
002091 77 VAR  PIC 9(9) VALUE ZERO.
002092 77 WS-SQLCODE PIC 9(9) VALUE ZERO.
002093
002100
002314
002315* VARIABLES UTILES DANS REMPLIS-QTY-TABLE.
002326 77 SNO-CUR         PIC X(2) VALUE SPACE.
002327 77 PNO-CUR         PIC X(2) VALUE SPACE.
002328
002329 77 WR-SNAME        PIC X(20) VALUE SPACES.
002330
002331* VARIABLES CORRESPONDANTS PARTSUPP
002332 77 WR-QTY          PIC 9(2)  VALUE ZERO.
002333
002334* VARIABLES CORRESPONDANTS PARTS
002335 77 WS-PNAME     PIC X(30) VALUE SPACES.
002336
002337 77 CH1          PIC X(20) VALUE SPACES.
002338 77 CH-LIGNE     PIC X(44) VALUE '*'.
002339 77 TARGET-CH    PIC X(44).
002342
002343 01 TABLEAU.
002344     05 PARTS-TAB OCCURS 5 TIMES.
002345         10 TAB-PNAME PIC X(30).
002346         10 TAB-PNO   PIC X(2).
002347     05 LG-PARTS  PIC 99.
002348     05 SUP-TAB  OCCURS 5 TIMES.
002349         10 TAB-SNAME PIC X(20).
002350         10 TAB-SNO   PIC X(2).
002351     05 LG-SUP    PIC 99.
002358
002359 01 QTY-TABLE.
002360    05 QTY-ROW OCCURS 3 TIMES.
002361       10 QTY-ROW-SNO     PIC X(2)  VALUE SPACES.
002362       10 QTY-ROW-SNAME   PIC X(20) VALUE SPACES.
002363       10 QTY-COL OCCURS 5 TIMES.
002364          15 QTY-VALUE PIC 9(2)     VALUE ZERO.
002444
002464
002465 PROCEDURE DIVISION.
002480
003712      PERFORM REMPLIS-PARTS-TAB
003717      PERFORM AFFICHE-PARTS-TAB
003718
003719      PERFORM REMPLIS-SUP-TAB
003733      PERFORM AFFICHE-SUP-TAB
003734
003735      PERFORM REMPLIS-QTY-TABLE
003736      PERFORM AFFICHE
004100      GOBACK.
004110********************************************
004120* PARAGRAPHES
004200********************************************
004760*CLOSE-FAFF.
004770*    CLOSE FAFF.
004780*OPEN-FAFF.
004790*    OPEN OUTPUT FAFF.
004791*CLOSE-CURS.
004792**   EXEC SQL CLOSE CURS END-EXEC.
004793
004794*OPEN-CURS.
004795*    EXEC SQL
004796*      OPEN CURS
004797*    END-EXEC.
004798
004799 CLOSE-CURS1.
004800     EXEC SQL CLOSE CURS1 END-EXEC.
004801
004802 CLOSE-CURS2.
004803     EXEC SQL CLOSE CURS2 END-EXEC.
004804
004805 CLOSE-CURS3.
004806     EXEC SQL CLOSE CURS3 END-EXEC.
004807
004808 OPEN-CURS1.
004809     EXEC SQL
004810       OPEN CURS1
004811     END-EXEC.
004812
004813 OPEN-CURS2.
004814     EXEC SQL
004815       OPEN CURS2
004816     END-EXEC.
004817
004818 OPEN-CURS3.
004819     EXEC SQL
004820       OPEN CURS3
004821     END-EXEC.
004822
004823*FETCH-CURS.
004824*    EXEC SQL
004825*        FETCH CURS
004826*        INTO :SUP-SNAME, :PARTS-PNAME, :PARTSUPP-QTY
004827*    END-EXEC.
004828
004829 FETCH-CURS1.
004830     EXEC SQL
004831         FETCH CURS1
004832         INTO :SUP-SNO, :SUP-SNAME, :PARTS-PNO, :PARTS-PNAME,
004833                 :PARTSUPP-QTY
004834     END-EXEC.
004835
004836 FETCH-CURS2.
004837     EXEC SQL
004838         FETCH CURS2
004839         INTO :PARTS-PNAME, :PARTS-PNO
004840     END-EXEC.
004841
004842 FETCH-CURS3.
004843     EXEC SQL
004844         FETCH CURS3
004845         INTO :SUP-SNAME, :SUP-SNO
004846     END-EXEC.
004847
004848 TEST-SQLCODE.
004849     EVALUATE TRUE
004850         WHEN SQLCODE = ZERO
004851              CONTINUE
004852         WHEN SQLCODE > ZERO
004853         MOVE SQLCODE TO WS-SQLCODE
004854              DISPLAY 'WARNING : ' WS-SQLCODE
004855         WHEN OTHER
004856         MOVE SQLCODE TO WS-SQLCODE
004857              DISPLAY 'ANOMALIE GRAVE : ' WS-SQLCODE
004858              PERFORM ABEND-PROG
004859     END-EVALUATE.
004860 ABEND-PROG.
004861     COMPUTE WS-ANO = WS-ANO / WS-VAR.
004862
004863 REMPLIS-TABLE1.
004864     MOVE 12345 TO QTY-VALUE (1, 1)
004865     MOVE 67890 TO QTY-VALUE (1, 2)
004866     MOVE 11111 TO QTY-VALUE (1, 3)
004867     MOVE 22222 TO QTY-VALUE (1, 4)
004868     MOVE 33333 TO QTY-VALUE (1, 5)
004869
004870     MOVE 54321 TO QTY-VALUE (2, 1)
004871     MOVE 98765 TO QTY-VALUE (2, 2)
004872     MOVE 66666 TO QTY-VALUE (2, 3)
004873     MOVE 77777 TO QTY-VALUE (2, 4)
004874     MOVE 88888 TO QTY-VALUE (2, 5)
004875                   .
004876
004890 AFFICHE-TABLE.
004891     PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 30
004892         DISPLAY "ROW "   WS-I
004893         PERFORM VARYING WS-J FROM 1 BY 1 UNTIL WS-J > 5
004894             DISPLAY  QTY-VALUE (WS-I, WS-J)
004895
004896         END-PERFORM
004897     END-PERFORM.
004898
004899 AFFICHE-PARTS-TAB.
004900      PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > LG-PARTS
004901          DISPLAY 'I = ' WS-I ' PNAME = ' TAB-PNAME(WS-I)
004902          DISPLAY 'I = ' WS-I ' PNO = '   TAB-PNO(WS-I)
004903          DISPLAY '*****************************'
004904      END-PERFORM
004910     .
004920
006900
007000 REMPLIS-PARTS-TAB.
007100      PERFORM OPEN-CURS2
007200      PERFORM FETCH-CURS2
007300      PERFORM TEST-SQLCODE
007310      MOVE ZERO TO WS-I
007400      PERFORM UNTIL SQLCODE NOT EQUAL ZERO
007500         ADD 1 TO WS-I
007600         DISPLAY 'I = ' WS-I
007700         MOVE PARTS-PNO TO TAB-PNO(WS-I)
007710         DISPLAY 'PNO = ' PARTS-PNO
007800         MOVE PARTS-PNAME-TEXT(1:PARTS-PNAME-LEN) TO
007900              TAB-PNAME(WS-I)
008000         INITIALIZE  ST-PARTS
008100         PERFORM FETCH-CURS2
008110         PERFORM TEST-SQLCODE
008200      END-PERFORM
008210      MOVE WS-I TO LG-PARTS
008300      PERFORM CLOSE-CURS3
008400      .
008500
008510 REMPLIS-SUP-TAB.
008520      PERFORM OPEN-CURS3
008530      PERFORM FETCH-CURS3
008540      PERFORM TEST-SQLCODE
008550      MOVE ZERO TO WS-I
008560      PERFORM UNTIL SQLCODE NOT EQUAL ZERO
008570         ADD 1 TO WS-I
008580         DISPLAY 'I = ' WS-I
008590         MOVE SUP-SNO TO TAB-SNO(WS-I)
008591         DISPLAY 'SNO = ' SUP-SNO
008592         MOVE SUP-SNAME-TEXT(1:SUP-SNAME-LEN) TO
008593              TAB-SNAME(WS-I)
008594         INITIALIZE  ST-SUP
008595         PERFORM FETCH-CURS3
008596         PERFORM TEST-SQLCODE
008597      END-PERFORM
008598      MOVE WS-I TO LG-SUP
008599      PERFORM CLOSE-CURS3
008600      .
008601
008602 REMPLIS-QTY-TABLE.
008638     PERFORM OPEN-CURS1
008639     INITIALIZE  ST-SUP
008640     INITIALIZE  ST-PARTS
008641     INITIALIZE  ST-PARTSUPP
008643     PERFORM FETCH-CURS1
008644     PERFORM TEST-SQLCODE
008646     MOVE 1 TO WS-I
008647     DISPLAY 'WS-I = ' WS-I
008648     PERFORM UNTIL SQLCODE NOT EQUAL ZERO
008649
008650       MOVE TAB-SNO(WS-I) TO SNO-CUR
008651       DISPLAY 'SNO-CUR = ' SNO-CUR
008652       PERFORM UNTIL SUP-SNO NOT EQUAL SNO-CUR OR
008653                                       SQLCODE NOT EQUAL ZERO
008654           MOVE  1 TO WS-J
008655           DISPLAY 'WS-J = 1'
008656           DISPLAY 'WS-I =  ' WS-I
008657               PERFORM UNTIL WS-J > 5 OR SUP-SNO NOT EQUAL SNO-CUR
008658                 MOVE TAB-PNO(WS-J) TO PNO-CUR
008659                 DISPLAY 'PNO-CUR = ' PNO-CUR
008660                 IF PARTS-PNO EQUAL  PNO-CUR
008661                     MOVE PARTSUPP-QTY TO QTY-VALUE(WS-I, WS-J)
008662                     DISPLAY 'PARTS-PNO EQUAL  PNO-CUR = ',
008663                          PNO-CUR
008664                     INITIALIZE  ST-SUP
008665                     INITIALIZE  ST-PARTS
008666                     INITIALIZE  ST-PARTSUPP
008667                     PERFORM FETCH-CURS1
008668                     PERFORM TEST-SQLCODE
008669                 END-IF
008670
008671                 ADD 1 TO WS-J
008672                 DISPLAY 'ON AJOUTE 1 à WS-J, WS-J= ' WS-J
008673               END-PERFORM
008674
008675               INITIALIZE  ST-SUP
008676               INITIALIZE  ST-PARTS
008677               INITIALIZE  ST-PARTSUPP
008678               PERFORM FETCH-CURS1
008679               PERFORM TEST-SQLCODE
008680       END-PERFORM
008681       ADD 1 TO WS-I
008682                 DISPLAY 'ON AJOUTE 1 à WS-I, WS-I= ' WS-I
008684     END-PERFORM
008685       PERFORM CLOSE-CURS1
008686       .
008687
008688
008689
008690 AFFICHE-SUP-TAB.
008700      PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > LG-SUP
008800          DISPLAY 'I = ' WS-I ' SNAME = ' TAB-SNAME(WS-I)
008900          DISPLAY 'I = ' WS-I ' SNO = '   TAB-SNO(WS-I)
009000          DISPLAY '*****************************'
009100      END-PERFORM
009200     .
009300 REMPLI.
011900      MOVE 'S1' TO QTY-ROW-SNO(1)
011901      MOVE 'NEWEGG' TO QTY-ROW-SNAME(1)
011902      MOVE 'S2' TO QTY-ROW-SNO(2)
011903      MOVE 'MICRO CENTER' TO QTY-ROW-SNAME(2)
011904      MOVE 'S3' TO QTY-ROW-SNO(3)
011905      MOVE 'ADAFRUIT' TO QTY-ROW-SNAME(3)
011906
011907
011908      MOVE 10 TO QTY-VALUE (1, 1)
011909      MOVE 20 TO QTY-VALUE (1, 2)
011910      MOVE 90 TO QTY-VALUE (1, 3)
011911      MOVE 20 TO QTY-VALUE (1, 5)
011912
011913      MOVE 12 TO QTY-VALUE (2, 1)
011914      MOVE 15 TO QTY-VALUE (2, 3)
011915      MOVE 25 TO QTY-VALUE (2, 4)
011916
011917      MOVE 18 TO QTY-VALUE (3, 2)
011918      MOVE 20 TO QTY-VALUE (3, 4)
011920      MOVE 30 TO QTY-VALUE (3, 5)
011930      .
011940
011950 AFFICHE.
011960
011963      STRING
011964             CH1         DELIMITED BY SIZE
011965             ' '        DELIMITED BY SIZE
011966             TAB-PNO(1)  DELIMITED BY SIZE
011967             ' '        DELIMITED BY SIZE
011968             TAB-PNO(2)  DELIMITED BY SIZE
011969             ' '        DELIMITED BY SIZE
011970             TAB-PNO(3)  DELIMITED BY SIZE
011971             ' '        DELIMITED BY SIZE
011972             TAB-PNO(4)  DELIMITED BY SIZE
011973             ' '        DELIMITED BY SIZE
011974             TAB-PNO(5)  DELIMITED BY SIZE
011975             ' '        DELIMITED BY SIZE
011976      INTO TARGET-CH
011977      END-STRING
011978
011979      DISPLAY TARGET-CH
011981      MOVE ALL "*" TO CH-LIGNE
011982      DISPLAY CH-LIGNE
011983      PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I  > 3
011984         DISPLAY QTY-ROW-SNAME(WS-I), ' '
011985             QTY-VALUE (WS-I, 1), ' ',
011986             QTY-VALUE (WS-I, 2), ' ',
011987             QTY-VALUE (WS-I, 3), ' ',
011988             QTY-VALUE (WS-I, 4), ' ',
011989             QTY-VALUE (WS-I, 5)
011990      END-PERFORM
011991           .
011992
011993
011994
011995
011996
011997
011998
011999
012000
012001
012002
012003
012004
012010
012100
