000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. P5.
000300
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SPECIAL-NAMES.
000700     DECIMAL-POINT IS COMMA.
000800
000900*INPUT-OUTPUT SECTION.
001000*FILE-CONTROL.
001100*    SELECT FAFF ASSIGN TO FICAFF.
001310
001320 DATA DIVISION.
001400*FILE SECTION.
001410* DECLARATION ENREGISTREMENTS FICHIER
001610*FD FAFF.
001620*01 ENR-FAFF PIC X(200).
001900
002000 WORKING-STORAGE SECTION.
002001******************************************
002002* INSERT DES DECLARATIONS SQL
002003     EXEC SQL INCLUDE SQLCA  END-EXEC.
002004* APPEL DU DLCGEN ...
002005     EXEC SQL INCLUDE PARTS  END-EXEC.
002006     EXEC SQL INCLUDE PARTSUPP  END-EXEC.
002007     EXEC SQL INCLUDE SUP    END-EXEC.
002017******************************************
002018* DECLARATION DU CURSEUR ORDERS
002019
002031
002032*    EXEC SQL
002033*        DECLARE CURS1 CURSOR
002034*        FOR
002035*        SELECT S.SNO, S.SNAME, P.PNO, P.PNAME, PA.QTY
002036*        FROM API11.PARTSUPP PA
002037*             JOIN API11.PARTS P ON PA.PNO = P.PNO
002038*             JOIN API11.SUPPLIER S ON PA.SNO = S.SNO
002039*        GROUP BY S.SNO, S.SNAME, P.PNO, P.PNAME, PA.QTY
002040*    END-EXEC.
002041
002042     EXEC SQL
002043         DECLARE CURS1 CURSOR
002044         FOR
002045         SELECT S.SNO, S.SNAME , P.PNO,
002046            P.PNAME, PA.QTY
002047         FROM API11.PARTSUPP PA JOIN API11.PARTS P ON
002048                        PA.PNO = P.PNO
002049                      JOIN API11.SUPPLIER S ON PA.SNO = S.SNO
002050         GROUP BY S.SNO, S.SNAME, P.PNO, P.PNAME, PA.QTY
002051         ORDER BY S.SNO, P.PNO
002052     END-EXEC.
002060
002061
002062
002063     EXEC SQL
002064         DECLARE CURS2 CURSOR
002065         FOR
002066         SELECT P.PNAME, P.PNO
002067         FROM API11.PARTS P
002068     END-EXEC.
002069
002070     EXEC SQL
002071         DECLARE CURS3 CURSOR
002072         FOR
002073         SELECT S.SNAME, S.SNO
002074         FROM API11.SUPPLIER S
002075     END-EXEC.
002076
002077
002078* VARIABLES FONCTION ABEND-PROG
002079 77 WS-ANO PIC 9 VALUE ZERO.
002080 77 WS-VAR PIC 9 VALUE ZERO.
002081
002082 77 WS-I PIC 99 VALUE ZERO.
002083 77 WS-J PIC 99 VALUE ZERO.
002090
002091 77 VAR  PIC 9(9) VALUE ZERO.
002092 77 WS-SQLCODE PIC 9(9) VALUE ZERO.
002093
002100
002314
002315* VARIABLES UTILES DANS REMPLIS-QTY-TABLE.
002326 77 SNO-CUR         PIC X(2) VALUE SPACE.
002327 77 PNO-CUR         PIC X(2) VALUE SPACE.
002328
002329 77 WR-SNAME        PIC X(20) VALUE SPACES.
002330
002331* VARIABLES CORRESPONDANTS PARTSUPP
002332 77 WR-QTY          PIC 9(2)  VALUE ZERO.
002333
002334* VARIABLES CORRESPONDANTS PARTS
002335 77 WS-PNAME     PIC X(30) VALUE SPACES.
002336
002337 77 CH1          PIC X(20) VALUE SPACES.
002338 77 CH-LIGNE     PIC X(44) VALUE '*'.
002339 77 TARGET-CH    PIC X(300).
002342
002343 01 TABLEAU.
002344     05 PARTS-TAB OCCURS 5 TIMES.
002345         10 TAB-PNAME PIC X(30).
002346         10 TAB-PNO   PIC X(2).
002347     05 LG-PARTS  PIC 99.
002348     05 SUP-TAB  OCCURS 5 TIMES.
002349         10 TAB-SNAME PIC X(20).
002350         10 TAB-SNO   PIC X(2).
002351     05 LG-SUP    PIC 99.
002358
002359 01 QTY-TABLE.
002360    05 QTY-ROW OCCURS 3 TIMES.
002361       10 QTY-ROW-SNO     PIC X(2)  VALUE SPACES.
002362       10 QTY-ROW-SNAME   PIC X(20) VALUE SPACES.
002363       10 QTY-COL OCCURS 5 TIMES.
002364          15 QTY-VALUE PIC 9(2)     VALUE ZERO.
002444
002464
002465 PROCEDURE DIVISION.
002480
003712      PERFORM REMPLIS-PARTS-TAB
003718
003719      PERFORM REMPLIS-SUP-TAB
003734
003735      PERFORM REMPLIS-QTY-TABLE
003736      PERFORM AFFICHE
003737*     PERFORM AFFICHE2
004100      GOBACK.
004110********************************************
004120* PARAGRAPHES
004200********************************************
004760*CLOSE-FAFF.
004770*    CLOSE FAFF.
004780*OPEN-FAFF.
004790*    OPEN OUTPUT FAFF.
004791*CLOSE-CURS.
004792**   EXEC SQL CLOSE CURS END-EXEC.
004793
004794*OPEN-CURS.
004795*    EXEC SQL
004796*      OPEN CURS
004797*    END-EXEC.
004798
004799 CLOSE-CURS1.
004800     EXEC SQL CLOSE CURS1 END-EXEC.
004801
004802 CLOSE-CURS2.
004803     EXEC SQL CLOSE CURS2 END-EXEC.
004804
004805 CLOSE-CURS3.
004806     EXEC SQL CLOSE CURS3 END-EXEC.
004807
004808 OPEN-CURS1.
004809     EXEC SQL
004810       OPEN CURS1
004811     END-EXEC.
004812
004813 OPEN-CURS2.
004814     EXEC SQL
004815       OPEN CURS2
004816     END-EXEC.
004817
004818 OPEN-CURS3.
004819     EXEC SQL
004820       OPEN CURS3
004821     END-EXEC.
004822
004823*FETCH-CURS.
004824*    EXEC SQL
004825*        FETCH CURS
004826*        INTO :SUP-SNAME, :PARTS-PNAME, :PARTSUPP-QTY
004827*    END-EXEC.
004828
004829 FETCH-CURS1.
004830     EXEC SQL
004831         FETCH CURS1
004832         INTO :SUP-SNO, :SUP-SNAME, :PARTS-PNO, :PARTS-PNAME,
004833                 :PARTSUPP-QTY
004834     END-EXEC.
004835
004836 FETCH-CURS2.
004837     EXEC SQL
004838         FETCH CURS2
004839         INTO :PARTS-PNAME, :PARTS-PNO
004840     END-EXEC.
004841
004842 FETCH-CURS3.
004843     EXEC SQL
004844         FETCH CURS3
004845         INTO :SUP-SNAME, :SUP-SNO
004846     END-EXEC.
004847
004848 TEST-SQLCODE.
004849     EVALUATE TRUE
004850         WHEN SQLCODE = ZERO
004851              CONTINUE
004852         WHEN SQLCODE > ZERO
004853         MOVE SQLCODE TO WS-SQLCODE
004854              DISPLAY 'WARNING : ' WS-SQLCODE
004855         WHEN OTHER
004856         MOVE SQLCODE TO WS-SQLCODE
004857              DISPLAY 'ANOMALIE GRAVE : ' WS-SQLCODE
004858              PERFORM ABEND-PROG
004859     END-EVALUATE.
004860 ABEND-PROG.
004861     COMPUTE WS-ANO = WS-ANO / WS-VAR.
004862
004863 REMPLIS-TABLE1.
004864     MOVE 12345 TO QTY-VALUE (1, 1)
004865     MOVE 67890 TO QTY-VALUE (1, 2)
004866     MOVE 11111 TO QTY-VALUE (1, 3)
004867     MOVE 22222 TO QTY-VALUE (1, 4)
004868     MOVE 33333 TO QTY-VALUE (1, 5)
004869
004870     MOVE 54321 TO QTY-VALUE (2, 1)
004871     MOVE 98765 TO QTY-VALUE (2, 2)
004872     MOVE 66666 TO QTY-VALUE (2, 3)
004873     MOVE 77777 TO QTY-VALUE (2, 4)
004874     MOVE 88888 TO QTY-VALUE (2, 5)
004875                   .
004876
004890 AFFICHE-TABLE.
004891     PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 30
004892         DISPLAY "ROW "   WS-I
004893         PERFORM VARYING WS-J FROM 1 BY 1 UNTIL WS-J > 5
004894             DISPLAY  QTY-VALUE (WS-I, WS-J)
004895
004896         END-PERFORM
004897     END-PERFORM.
004898
004899 AFFICHE-PARTS-TAB.
004900      PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > LG-PARTS
004901          DISPLAY 'I = ' WS-I ' PNAME = ' TAB-PNAME(WS-I)
004902          DISPLAY 'I = ' WS-I ' PNO = '   TAB-PNO(WS-I)
004903          DISPLAY '*****************************'
004904      END-PERFORM
004910     .
004920
006900
007000 REMPLIS-PARTS-TAB.
007100      PERFORM OPEN-CURS2
007200      PERFORM FETCH-CURS2
007300      PERFORM TEST-SQLCODE
007310      MOVE ZERO TO WS-I
007400      PERFORM UNTIL SQLCODE NOT EQUAL ZERO
007500         ADD 1 TO WS-I
007700         MOVE PARTS-PNO TO TAB-PNO(WS-I)
007800         MOVE PARTS-PNAME-TEXT(1:PARTS-PNAME-LEN) TO
007900              TAB-PNAME(WS-I)
008000         INITIALIZE  ST-PARTS
008100         PERFORM FETCH-CURS2
008110         PERFORM TEST-SQLCODE
008200      END-PERFORM
008210      MOVE WS-I TO LG-PARTS
008300      PERFORM CLOSE-CURS3
008400      .
008500
008510 REMPLIS-SUP-TAB.
008520      PERFORM OPEN-CURS3
008530      PERFORM FETCH-CURS3
008540      PERFORM TEST-SQLCODE
008550      MOVE ZERO TO WS-I
008560      PERFORM UNTIL SQLCODE NOT EQUAL ZERO
008570         ADD 1 TO WS-I
008590         MOVE SUP-SNO TO TAB-SNO(WS-I)
008592         MOVE SUP-SNAME-TEXT(1:SUP-SNAME-LEN) TO
008593              TAB-SNAME(WS-I)
008594         INITIALIZE  ST-SUP
008595         PERFORM FETCH-CURS3
008596         PERFORM TEST-SQLCODE
008597      END-PERFORM
008598      MOVE WS-I TO LG-SUP
008599      PERFORM CLOSE-CURS3
008600      .
008601
008690 AFFICHE-SUP-TAB.
008700      PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > LG-SUP
009100      END-PERFORM
009200     .
009300 REMPLI.
011900      MOVE 'S1' TO QTY-ROW-SNO(1)
011901      MOVE 'NEWEGG' TO QTY-ROW-SNAME(1)
011902      MOVE 'S2' TO QTY-ROW-SNO(2)
011903      MOVE 'MICRO CENTER' TO QTY-ROW-SNAME(2)
011904      MOVE 'S3' TO QTY-ROW-SNO(3)
011905      MOVE 'ADAFRUIT' TO QTY-ROW-SNAME(3)
011906
011907
011908      MOVE 10 TO QTY-VALUE (1, 1)
011909      MOVE 20 TO QTY-VALUE (1, 2)
011910      MOVE 90 TO QTY-VALUE (1, 3)
011911      MOVE 20 TO QTY-VALUE (1, 5)
011912
011913      MOVE 12 TO QTY-VALUE (2, 1)
011914      MOVE 15 TO QTY-VALUE (2, 3)
011915      MOVE 25 TO QTY-VALUE (2, 4)
011916
011917      MOVE 18 TO QTY-VALUE (3, 2)
011918      MOVE 20 TO QTY-VALUE (3, 4)
011920      MOVE 30 TO QTY-VALUE (3, 5)
011930      .
011940
011950 AFFICHE.
011960
011963      STRING
011964             CH1         DELIMITED BY SIZE
011965             ' '        DELIMITED BY SIZE
011966             TAB-PNAME(1)  DELIMITED BY ' '
011967             ' '                        ' '
011968             TAB-PNAME(2)  DELIMITED BY ' '
011969             ' '        DELIMITED BY ' '
011970             TAB-PNAME(3)  DELIMITED BY ' '
011971             ' '        DELIMITED BY SIZE
011972             TAB-PNAME(4)  DELIMITED BY ' '
011973             ' '        DELIMITED BY ' '
011974             TAB-PNAME(5)  DELIMITED BY ' '
011975             ' '        DELIMITED BY ' '
011976      INTO TARGET-CH
011977      END-STRING
011978
011979      DISPLAY TARGET-CH
011981      MOVE ALL "*" TO CH-LIGNE
011982      DISPLAY CH-LIGNE
011983      PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I  > 3
011984*        DISPLAY QTY-ROW-SNAME(WS-I), ' '
011985         DISPLAY TAB-SNAME(WS-I), ' '
011986             QTY-VALUE (WS-I, 1), ' ',
011987             QTY-VALUE (WS-I, 2), ' ',
011988             QTY-VALUE (WS-I, 3), ' ',
011989             QTY-VALUE (WS-I, 4), ' ',
011990             QTY-VALUE (WS-I, 5)  ' '
012000      END-PERFORM
012012           .
012013
012014
012015
012016 REMPLIS-QTY-TABLE.
012017     PERFORM OPEN-CURS1
012018     INITIALIZE  ST-SUP
012019     INITIALIZE  ST-PARTS
012020     INITIALIZE  ST-PARTSUPP
012021     PERFORM FETCH-CURS1
012022     PERFORM TEST-SQLCODE
012023     MOVE 1 TO WS-I
012025     PERFORM UNTIL SQLCODE NOT EQUAL ZERO
012026
012027       MOVE TAB-SNO(WS-I) TO SNO-CUR
012029       PERFORM UNTIL SUP-SNO NOT EQUAL SNO-CUR OR
012030                                       SQLCODE NOT EQUAL ZERO
012031           MOVE  1 TO WS-J
012034               PERFORM UNTIL WS-J > 5 OR SUP-SNO NOT EQUAL SNO-CUR
012035                 MOVE TAB-PNO(WS-J) TO PNO-CUR
012037                 IF PARTS-PNO EQUAL  PNO-CUR
012038                     MOVE PARTSUPP-QTY TO QTY-VALUE(WS-I, WS-J)
012040                          PNO-CUR
012041                     INITIALIZE  ST-SUP
012042                     INITIALIZE  ST-PARTS
012043                     INITIALIZE  ST-PARTSUPP
012044                     PERFORM FETCH-CURS1
012045                     PERFORM TEST-SQLCODE
012046                 END-IF
012047                 ADD 1 TO WS-J
012049                END-PERFORM
012050
012051*               INITIALIZE  ST-SUP
012052*               INITIALIZE  ST-PARTS
012053*               INITIALIZE  ST-PARTSUPP
012060*               PERFORM FETCH-CURS1
012070*               PERFORM TEST-SQLCODE
012080        END-PERFORM
012090        ADD 1 TO WS-I
012200      END-PERFORM
012300        PERFORM CLOSE-CURS1
012400             .
012500 AFFICHE2.
012600     DISPLAY 'TOTO'
012700     DISPLAY TAB-PNAME(1) (1:5)
012701
012702     DISPLAY TAB-PNAME(2)
012703     DISPLAY TAB-PNAME(3)
012704     DISPLAY TAB-PNAME(4)
012705     DISPLAY TAB-PNAME(5)
012706     DISPLAY 'TITI'
012707
012708     MOVE SPACES TO TARGET-CH
012709
012710     STRING
012711         CH1                 DELIMITED BY ' '
012712         TAB-PNAME(1) (1:20) DELIMITED BY ' '
012714         ' '                 DELIMITED BY ' '
012715         TAB-PNAME(2) (1:20) DELIMITED BY ' '
012716         ' '                 DELIMITED BY ' '
012717         TAB-PNAME(3) (1:20) DELIMITED BY ' '
012718         ' '                 DELIMITED BY ' '
012719         TAB-PNAME(4) (1:20) DELIMITED BY ' '
012720         ' '                 DELIMITED BY ' '
012721         TAB-PNAME(5) (1:20) DELIMITED BY ' '
012722         ' '                 DELIMITED BY ' '
012723     INTO TARGET-CH
012724     END-STRING
012725
012726     MOVE SPACES TO TARGET-CH
012727     PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-J > 5
012729     STRING
012730         TAB-SNAME(WS-I)        DELIMITED ' '
012740         ' '                 DELIMITED BY SIZE
012750         QTY-VALUE (WS-I, 1) DELIMITED BY SIZE
012760         ' '                 DELIMITED BY SIZE
012770         QTY-VALUE (WS-I, 2) DELIMITED BY SIZE
012780         ' '                 DELIMITED BY SIZE
012790         QTY-VALUE (WS-I, 3) DELIMITED BY SIZE
012800         ' '                 DELIMITED BY SIZE
012900         QTY-VALUE (WS-I, 4) DELIMITED BY SIZE
013000         ' '                 DELIMITED BY SIZE
013100         QTY-VALUE (WS-I, 5) DELIMITED BY SIZE
013200     INTO TARGET-CH
013300     END-STRING
013400     DISPLAY TARGET-CH
013410     DISPLAY QTY-VALUE (1, 5)
013500     END-PERFORM
013600          .
013700
013800
013900
014000
014100
014200
014300
014400
014500
014600
014700
014800
014900
015000
015100
015200
015300
015400
015500
015600
015700
015800
015900
